## Relatório de análise IV

## Seleção de Frequências

In [1]:
import pandas as pd

In [2]:
dados = pd.read_csv('dados/aluguel.csv', sep = ';')

In [3]:
dados.head(10)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
5,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
6,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0
7,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000.0,NaN,NaN
8,Casa de Condomínio,Ramos,2,2,0,65,1000.0,NaN,NaN
9,Conjunto Comercial/Sala,Centro,0,3,0,695,35000.0,19193.0,3030.0

In [4]:
dados.shape

(32960, 9)

In [5]:
# Selecione somente os imóveis classificados com tipo 'Apartamento'

In [6]:
selecao = dados ['Tipo'] == 'Apartamento'
n1 = dados[selecao].shape[0]
n1

19532

In [7]:
# Selecione os imóveis classificados com tipos 'casa', 'casa de condomínio' e 'casa de vila'

In [8]:
selecao = (dados ['Tipo'] == 'Casa')|(dados ['Tipo'] == 'Casa de Condomínio')|(dados ['Tipo'] == 'Casa de Vila')
n2 = dados[selecao].shape[0]
n2

2212

In [9]:
# selecione os imóveis com área entre 60 e 100 metros quadrados, incluindo os limites
# 60 <= área <= 100

In [10]:
selecao = (dados ['Area'] >= 60) & (dados ['Area'] <= 100)
n3 = dados[selecao].shape[0]
n3

10187

In [11]:
# Selecione os imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00

In [12]:
selecao =(dados ['Quartos'] >= 4) & (dados ['Valor'] < 2000)
n4 =dados[selecao].shape[0]
n4

43

In [13]:
print("Nº de  imóveis classificados com tipo 'Apartamento' -> {}". format(n1))
print("Nº de  imóveis classificados com tipos 'casa', 'casa de condomínio' e 'casa de vila' -> {}". format(n2))
print("Nº de  imóveis com área entre 60 e 100 metros quadrados, incluindo os limites -> {}". format(n3))
print("Nº de  imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00 -> {}". format(n4))

Nº de  imóveis classificados com tipo 'Apartamento' -> 19532
Nº de  imóveis classificados com tipos 'casa', 'casa de condomínio' e 'casa de vila' -> 2212
Nº de  imóveis com área entre 60 e 100 metros quadrados, incluindo os limites -> 10187
Nº de  imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00 -> 43

In [14]:
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])

In [15]:
alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [16]:
selecao = alunos['Aprovado'] == 'True'
aprovados = alunos[selecao]
aprovados

Empty DataFrame
Columns: [Nome, Idade, Sexo, Notas, Aprovado]
Index: []

In [17]:
# selecao = alunos['Aprovado'] = True
# aprovados = alunos[selecao]
# aprovados


selecao = alunos['Aprovado'] == True
aprovados = alunos[selecao]
aprovados

    Nome  Idade Sexo  Notas  Aprovado
0    Ary     15    M    7.5      True
3   Beto     32    M   10.0      True
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True